src/Documents/СозданиеИИзменениеПроекта/СозданиеИИзменениеПроекта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СозданиеИИзменениеПроекта</name>
  <registerRecords>InformationRegister.ИсторияПроектов</registerRecords>
  <attributes>
    <name>НазваниеПроекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РуководительПроекта</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаписьВСправочникеПроекты</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КомандаПроекта</name>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.Должности</types>
      </type>
    </attributes>
    <attributes>
      <name>НеобходимыйПроцентЗанятостиНаПроекте</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Catalogs/Проекты/Проекты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Проекты</name>
  <attributes>
    <name>РуководительПроекта</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.СозданиеИИзменениеПроекта</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>КомандаПроекта</name>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.Должности</types>
      </type>
    </attributes>
    <attributes>
      <name>НеобходимыйПроцентЗанятостиНаПроекте</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Documents/СозданиеИИзменениеПроекта/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	// Проверим существует ли уже запись в справочнике
	
	Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |    Проекты.Ссылка КАК Ссылка
    |ИЗ
    |    Справочник.Проекты КАК Проекты
    |ГДЕ
    |    Проекты.ДокументОснование = &ДокументОснование";
    
    Запрос.УстановитьПараметр("ДокументОснование", Ссылка);
    Результат = Запрос.Выполнить();
    Выборка = Результат.Выбрать();
    
    Если Выборка.Следующий() Тогда
        ПроектСпр = Выборка.Ссылка.ПолучитьОбъект();
    Иначе
        ПроектСпр = Справочники.Проекты.СоздатьЭлемент();
    КонецЕсли;
	
	ПроектСпр.ДокументОснование = Ссылка;
	ПроектСпр.Наименование = НазваниеПроекта;
	ПроектСпр.РуководительПроекта = РуководительПроекта;
	ПроектСпр.ДатаНачала = ДатаНачала;
	ПроектСпр.ДатаОкончания = ДатаОкончания;
	ЗаписьВСправочникеПроекты = ПроектСпр.Ссылка;
	
	ПроектСпр.КомандаПроекта.Очистить();
	Для Каждого СтрокаТЧ Из КомандаПроекта Цикл
        НоваяСтрока = ПроектСпр.КомандаПроекта.Добавить();
        НоваяСтрока.Должность = СтрокаТЧ.Должность;
        НоваяСтрока.НеобходимыйПроцентЗанятостиНаПроекте = СтрокаТЧ.НеобходимыйПроцентЗанятостиНаПроекте;
        НоваяСтрока.Сотрудник = СтрокаТЧ.Сотрудник;
	КонецЦикла;
	
    ПроектСпр.Записать();

КонецПроцедуры

#КонецОбласти
#Иначе
  ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
